{
  "nav_home": "Home",
  "nav_resources": "Resources",
  "nav_update": "Update",
  "nav_login": "Login",
  "welcome_title": "Welcome to JLPT N5",
  "welcome_desc": "Your one-stop terminal for JLPT N5 preparation. Access resources, updates, and more.",
  "footer_copy": "&copy; {{year}} JLPT N5 Master. All rights reserved.",
  "footer_terms": "Terms and Condition",
  "footer_privacy": "Privacy Policy",
  "terms_title": "Terms and Conditions",
  "terms_intro": "Welcome to JLPT N5 Master. By accessing our website, you agree to these terms.",
  "terms_sec1_title": "1. Acceptable Use",
  "terms_sec1_desc": "You agree to use this site only for lawful purposes related to JLPT preparation. Any unauthorized scraping or modification of the site content is prohibited.",
  "terms_sec2_title": "2. Intellectual Property",
  "terms_sec2_desc": "All resources provided are for educational use. The design and architecture of this site are property of the JLPT N5 Master team.",
  "terms_sec3_title": "3. Limitation of Liability",
  "terms_sec3_desc": "We strive for accuracy but do not guarantee that all preparation materials are free of errors. Use these resources at your own risk.",
  "terms_sec4_title": "4. Changes to Terms",
  "terms_sec4_desc": "We reserve the right to update these terms at any time. Continued use of the site implies acceptance of the updated terms.",
  "privacy_title": "Privacy Policy",
  "privacy_intro": "Your privacy is important to us. This policy explains how we handle your information.",
  "privacy_sec1_title": "1. Data Collection",
  "privacy_sec1_desc": "We do not collect personal data unless you explicitly log in. When logged in, we only store your progress and preferences.",
  "privacy_sec2_title": "2. Local Storage",
  "privacy_sec2_desc": "We use local storage on your device to remember your theme (dark/light mode) and language settings. This data never leaves your browser.",
  "privacy_sec3_title": "3. Third-Party Services",
  "privacy_sec3_desc": "We use Google Fonts to provide a better reading experience. These services may collect basic telemetry data as per their own privacy policies.",
  "privacy_sec4_title": "4. Security",
  "privacy_sec4_desc": "We implement modern security practices to protect your data. However, no internet-based service is 100% secure."
}
